#### What are the types of missing Data?
    1.Missing completely at Random,MCAR :

In [13]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('titanic.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
df[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

#### 2.Missing data Not at Random(MNAR) : Systematic Missing Values

In [18]:
df['cabin_null'] = np.where(df['Cabin'].isnull(),1,0)

## find the percentage of null values
df['cabin_null'].mean()

0.7710437710437711

In [19]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'cabin_null'],
      dtype='object')

In [21]:
df.groupby(['Survived'])['cabin_null'].mean()

# 60% of survived people are having mising values
# 80% those who didnt survived are having missing values

Survived
0    0.876138
1    0.602339
Name: cabin_null, dtype: float64

#### Missing at Random(MAR) :

In [23]:
# Men - Hide there salary
# Women - age

# Technique used to handle the missing values
#1.Mean/Median/mode Replacement
#2.Random sample imputation
#3.Capturing NaN values with a new feature
#4.End of distribution imputation
#5.Arbitrary imputation
#6.Frequent categories imputation